.doom.d/config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; [[file:/var/folders/t9/s0fd1ny92lz5pg1bg4_wxl1h0000gp/T/config.org.PRBggT::*Personal Information][Personal Information:1]]
(setq user-full-name "Wojtek Wrona"
      user-mail-address "wojtodzio@gmail.com")
;; Personal Information:1 ends here

;; [[file:/var/folders/t9/s0fd1ny92lz5pg1bg4_wxl1h0000gp/T/config.org.PRBggT::*Theme][Theme:1]]
(setq doom-theme 'doom-one)
;; Theme:1 ends here

;; [[file:/var/folders/t9/s0fd1ny92lz5pg1bg4_wxl1h0000gp/T/config.org.PRBggT::*Org][Org:1]]
(setq org-directory "~/org/")
;; Org:1 ends here

;; [[file:/var/folders/t9/s0fd1ny92lz5pg1bg4_wxl1h0000gp/T/config.org.PRBggT::*Line numbers][Line numbers:1]]
(setq display-line-numbers-type t)
;; Line numbers:1 ends here

;; [[file:/var/folders/t9/s0fd1ny92lz5pg1bg4_wxl1h0000gp/T/config.org.PRBggT::*Dictionaries][Dictionaries:1]]
(setq ispell-dictionary "en-custom")
;; Dictionaries:1 ends here

;; [[file:/var/folders/t9/s0fd1ny92lz5pg1bg4_wxl1h0000gp/T/config.org.PRBggT::*Web mode default indentions][Web mode default indentions:1]]
(setq web-mode-markup-indent-offset 2)
(setq web-mode-code-indent-offset 2)
(setq web-mode-script-padding 2)
;; Web mode default indentions:1 ends here

;; [[file:/var/folders/t9/s0fd1ny92lz5pg1bg4_wxl1h0000gp/T/config.org.PRBggT::*Projects path][Projects path:1]]
(setq projectile-project-search-path '("~/projects/"))
;; Projects path:1 ends here
